src/DataProcessors/СозданиеПредставленийТаблицВсубд.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>СозданиеПредставленийТаблицВсубд</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВариантОбработки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ссылки</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сервер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объекты</Name>
					<Type>
						<v8:Type>v8:ValueTree</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/DataProcessors/СозданиеПредставленийТаблицВсубд/Forms/Форма/module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

Перем мШрифтЖирный;

////////////////////////////////////////////////////////////////////////////////
// ОБЩИЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура УстановитьСвойстваЭлементов()
	
	Пометка = Булево(ВариантОбработки);
	
	ЭлементыФормы.Пользователь.Доступность = Пометка;
	ЭлементыФормы.Пароль.Доступность       = Пометка;
	
КонецПроцедуры

Процедура ИзменитьПометки(Пометка, Дерево)
	
	Для Каждого СтрокаДерево Из Дерево.Строки Цикл 
		СтрокаДерево.Пометка = Пометка;
		ИзменитьПометки(Пометка, СтрокаДерево);
	КонецЦикла;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

Процедура СформироватьСкриптПриИзменении(Элемент)
	
	УстановитьСвойстваЭлементов();
	
КонецПроцедуры

Процедура СформироватьИВыполнитьСкриптПриИзменении(Элемент)
	
	УстановитьСвойстваЭлементов();
	
КонецПроцедуры

Процедура ОбъектыПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	
	Если Не ДанныеСтроки.Уровень() Тогда 
		ОформлениеСтроки.Шрифт = мШрифтЖирный;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбъектыПриИзмененииФлажка(Элемент, Колонка)
	
	ТекущиеДанные = ЭлементыФормы.Объекты.ТекущиеДанные;
	ИзменитьПометки(ТекущиеДанные.Пометка, ТекущиеДанные);
	
	ДанныеКласса = ?(ТекущиеДанные.Родитель = Неопределено, ТекущиеДанные, ТекущиеДанные.Родитель);
	ДанныеКласса.Пометка = (ДанныеКласса.Строки.Найти(Ложь, "Пометка") = Неопределено);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПриОткрытии()
	
	Соединение = СтрокаСоединенияИнформационнойБазы();
	Если Лев(Соединение, 5) = "Srvr=" Тогда 
		Соединение = СтрЗаменить(Соединение, "Srvr=", "");
		Соединение = СтрЗаменить(Соединение, "Ref=", "");
		Соединение = СтрЗаменить(Соединение, """", "");
		Соединение = СтрЗаменить(Соединение, ";", Символы.ПС);
		БД = СтрПолучитьСтроку(Соединение, 2);
		Пользователь = "sa";
	КонецЕсли;
	
	Соединение = СтрокаСоединенияИнформационнойБазы();
	ТекИБ 		= ПараметрыСеанса.ТекущаяИБ;
	Если СтрНайти(ТекИБ.СерверХост, "ost") Тогда
		Сервер 		= ТекИБ.СерверХост;
	Иначе
		Сервер 		= РегистрыСведений.ДополнительныеСвойства.ЗначениеСвойства(ТекИБ, "Лояльность_СерверSQL");
	КонецЕсли;                         		
	Пользователь= РегистрыСведений.ДополнительныеСвойства.ЗначениеСвойства(ТекИБ, "Лояльность_ИмяПользователяSQL");
	Пароль 		= РегистрыСведений.ДополнительныеСвойства.ЗначениеСвойства(ТекИБ, "Лояльность_ПарольSQL");
	

	
	УстановитьСвойстваЭлементов();
	ОбновитьСписокОбъектов();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ ДЕЙСТВИЙ

Процедура КнопкаВыполнитьНажатие(Кнопка)
	
	Если ВариантОбработки Тогда // Выполнить.
		СоздатьПредставления();
	Иначе // Показать.
		Скрипт = СформироватьСкрипт();
		стрСкрипт = СтрСоединить(Скрипт.Пакет,"
		|GO
		|");
		Если Не ПустаяСтрока(стрСкрипт) Тогда 
			ТекстовыйДокумент = Новый ТекстовыйДокумент;
			ТекстовыйДокумент.УстановитьТекст(стрСкрипт);
			ТекстовыйДокумент.Показать("Script SQL", "Script.sql");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура КоманднаяПанельОбъектыУстановитьПометки(Кнопка)
	
	ИзменитьПометки(Истина, Объекты);
	
КонецПроцедуры

Процедура КоманднаяПанельОбъектыСнятьПометки(Кнопка)
	
	ИзменитьПометки(Ложь, Объекты);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОСНОВНОЙ ТЕКСТ ПРОГРАММЫ

мШрифтЖирный = Новый Шрифт(,, Истина);
